Microchip-Ethernet/EVB-KSZ9477/KSZ/Atmel_SOC_SAMA5D3/buildroot/host/opt/sam-ba/applets/samd20j18/libraries/sam0/drivers/nvm/nvm.h
	/** Enter power reduction mode in the NVM controller to reduce the power
	 *  consumption of the system. When in low power mode, all commands other
	 *  than \ref NVM_COMMAND_EXIT_LOW_POWER_MODE will fail.
	 */
	NVM_COMMAND_ENTER_LOW_POWER_MODE       = NVMCTRL_CTRLA_CMD_SPRM,

	/** Exit power reduction mode in the NVM controller to allow other NVM
	 *  commands to be issued.
	 */
	NVM_COMMAND_EXIT_LOW_POWER_MODE        = NVMCTRL_CTRLA_CMD_CPRM,
};

/**
 * \brief NVM controller power reduction mode configurations.
 *
 * Power reduction modes of the NVM controller, to conserve power while the
 * device is in sleep.
 */
enum nvm_sleep_power_mode {
	/** NVM controller exits low power mode on first access after sleep. */
	NVM_SLEEP_POWER_MODE_WAKEONACCESS  = NVMCTRL_CTRLB_SLEEPPRM_WAKEONACCESS,
	/** NVM controller exits low power mode when the device exits sleep mode. */
	NVM_SLEEP_POWER_MODE_WAKEUPINSTANT = NVMCTRL_CTRLB_SLEEPPRM_WAKEUPINSTANT,
	/** Power reduction mode in the NVM controller disabled. */
	NVM_SLEEP_POWER_MODE_ALWAYS_AWAKE  = NVMCTRL_CTRLB_SLEEPPRM_DISABLED,
};

/**
 * \brief NVM controller configuration structure.
 *
 * Configuration structure for the NVM controller within the device.
 */
struct nvm_config {
	/** Power reduction mode during device sleep. */
	enum nvm_sleep_power_mode sleep_power_mode;
	/** Manual write mode; if enabled, pages loaded into the NVM buffer will
	 *  not be written until a separate write command is issued. If disabled,
	 *  writing to the last byte in the NVM page buffer will trigger an automatic
	 *  write.
	 *
	 *  \note If a partial page is to be written, a manual write command must be
	 *        executed in either mode.
	 */
	bool manual_page_write;
	/** Number of wait states to insert when reading from flash, to prevent
	 *  invalid data from being read at high clock frequencies.
	 */
	uint8_t wait_states;
};

/**
 * \brief NVM memory parameter structure.
 *
 * Structure containing the memory layout parameters of the NVM module.
 */
struct nvm_parameters {
	/** Number of bytes per page. */
	uint8_t  page_size;
	/** Number of pages in the main array. */
	uint16_t nvm_number_of_pages;
	/** Size of the emulated EEPROM memory section configured in the NVM
	 *  auxiliary memory space. */
	uint32_t eeprom_number_of_pages;
	/** Size of the Bootloader memory section configured in the NVM auxiliary
	 *  memory space. */
	uint32_t bootloader_number_of_pages;
};

/**
 * \brief Bootloader size.
 *
 * Available bootloader protection sizes in kilobytes.
 *
 */
enum nvm_bootloader_size {
	NVM_BOOTLOADER_SIZE_128,
	NVM_BOOTLOADER_SIZE_64,
	NVM_BOOTLOADER_SIZE_32,
	NVM_BOOTLOADER_SIZE_16,
	NVM_BOOTLOADER_SIZE_8,
	NVM_BOOTLOADER_SIZE_4,
	NVM_BOOTLOADER_SIZE_2,
	NVM_BOOTLOADER_SIZE_0,
};

/**
 * \brief EEPROM emulator size.
 *
 * Available space in flash dedicated for EEPROM emulator in bytes.
 *
 */
enum nvm_eeprom_emulator_size {
	NVM_EEPROM_EMULATOR_SIZE_16384,
	NVM_EEPROM_EMULATOR_SIZE_8192,
	NVM_EEPROM_EMULATOR_SIZE_4096,
	NVM_EEPROM_EMULATOR_SIZE_2048,
	NVM_EEPROM_EMULATOR_SIZE_1024,
	NVM_EEPROM_EMULATOR_SIZE_512,
	NVM_EEPROM_EMULATOR_SIZE_256,
	NVM_EEPROM_EMULATOR_SIZE_0,
};

/**
 * \brief BOD33 Action.
 *
 * What action should be triggered when BOD33 is detected.
 *
 */
enum nvm_bod33_action {
	NVM_BOD33_ACTION_NONE,
	NVM_BOD33_ACTION_RESET,
	NVM_BOD33_ACTION_INTERRUPT,
};

/**
 * \brief BOD12 Action
 *
 * What action should be triggered when BOD12 is detected.
 *
 */
enum nvm_bod12_action {
	NVM_BOD12_ACTION_NONE,
	NVM_BOD12_ACTION_RESET,
	NVM_BOD12_ACTION_INTERRUPT,
};

/**
 * \brief WDT Window time-out period
 *
 * Windows mode time-out period in clock cycles.
 *
 */
enum nvm_wdt_window_timeout {
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_8,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_16,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_32,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_64,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_128,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_256,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_512,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_1024,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_2048,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_4096,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_8192,
	NVM_WDT_WINDOW_TIMEOUT_PERIOD_16384,
};

/**
 * \brief WDT Early warning offset
 *
 * This setting determine how many GCLK_WDT cycles before a watchdog time-out period
 * an early warning interrupt should be triggered.
 *
 */
enum nvm_wdt_early_warning_offset {
	NVM_WDT_EARLY_WARNING_OFFSET_8,
	NVM_WDT_EARLY_WARNING_OFFSET_16,
	NVM_WDT_EARLY_WARNING_OFFSET_32,
	NVM_WDT_EARLY_WARNING_OFFSET_64,
	NVM_WDT_EARLY_WARNING_OFFSET_128,
	NVM_WDT_EARLY_WARNING_OFFSET_256,
	NVM_WDT_EARLY_WARNING_OFFSET_512,
	NVM_WDT_EARLY_WARNING_OFFSET_1024,
	NVM_WDT_EARLY_WARNING_OFFSET_2048,
	NVM_WDT_EARLY_WARNING_OFFSET_4096,
	NVM_WDT_EARLY_WARNING_OFFSET_8192,
	NVM_WDT_EARLY_WARNING_OFFSET_16384,
};

/**
 * \brief NVM user row fuse setting structure
 *
 * This structure contain the layout of the first 64 bits of the user row
 * which contain the fuse settings.
 */
struct nvm_fusebits {
	/** Bootloader size. */
	enum nvm_bootloader_size          bootloader_size;
	/** EEPROM emulation area size */
	enum nvm_eeprom_emulator_size     eeprom_size;
	/** BOD33 Threshold level at power on */
	uint8_t                           bod33_level;
	/** BOD33 Enable at power on */
	bool                              bod33_enable;
	/** BOD33 Action at power on */
	enum nvm_bod33_action             bod33_action;
	/** BOD12 Threshold level at power on */
	uint8_t                           bod12_level;
	/** BOD12 Enable at power on */
	bool                              bod12_enable;
	/** BOD12 Action at power on */
	enum nvm_bod12_action             bod12_action;
	/** WDT Enable at power on */
	bool                              wdt_enable;
	/** WDT Always-on at power on */
	bool                              wdt_always_on;
	/** WDT Period at power on */
	uint8_t                           wdt_timeout_period;
	/** WDT Window mode time-out at power on */
	enum nvm_wdt_window_timeout       wdt_window_timeout;
	/** WDT Early warning interrupt time offset at power on */
	enum nvm_wdt_early_warning_offset wdt_early_warning_offset;
	/** WDT Window mode enabled at power on */
	bool                              wdt_window_mode_enable_at_poweron;
	/** NVM Lock bits */
	uint16_t                          lockbits;
};

/**
 * \name Configuration and Initialization
 * @{
 */

/**
 * \brief Initializes an NVM controller configuration structure to defaults.
 *
 * Initializes a given NVM controller configuration structure to a set of
 * known default values. This function should be called on all new
 * instances of these configuration structures before being modified by the
 * user application.
 *
 * The default configuration is as follows:
 *  \li Power reduction mode enabled after sleep until first NVM access
 *  \li Automatic page commit when full pages are written to
 *  \li Number of FLASH wait states left unchanged
 *
 * \param[out] config  Configuration structure to initialize to default values
 *
 */
static inline void nvm_get_config_defaults(
		struct nvm_config *const config)
{
	/* Sanity check the parameters */
	Assert(config);

	/* Write the default configuration for the NVM configuration */
	config->sleep_power_mode  = NVM_SLEEP_POWER_MODE_WAKEONACCESS;
	config->manual_page_write = false;
	config->wait_states       = NVMCTRL->CTRLB.bit.RWS;
}

enum status_code nvm_set_config(void);

/**
 * \brief Checks if the NVM controller is ready to accept a new command.
 *
 * Checks the NVM controller to determine if it is currently busy execution an
 * operation, or ready for a new command.
 *
 * \return Busy state of the NVM controller.
 *
 * \retval true   If the hardware module is ready for a new command
 * \retval false  If the hardware module is busy executing a command
 *
 */
static inline bool nvm_is_ready(void)
{
	/* Get a pointer to the module hardware instance */
	Nvmctrl *const nvm_module = NVMCTRL;

	return nvm_module->INTFLAG.reg & NVMCTRL_INTFLAG_READY;
}

/** @} */

/**
 * \name NVM Access Management
 * @{
 */

